vinhlephu-lpv/robot-ws/src/esp32_source/code0109.ino
#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>

// ============================================================
//  1. CẤU HÌNH PHẦN CỨNG & THÔNG SỐ XE
// ============================================================
#define ENCODER_PPR             200       // Xung/vòng trục bánh xe
#define WHEEL_DIAMETER_M        0.20f     // Đường kính bánh xe: 200mm (0.2m)
#define WHEEL_CIRCUMFERENCE     (PI * WHEEL_DIAMETER_M)  // Chu vi bánh ≈ 0.6283m

// Khoảng thời gian chu kỳ tính toán
#define SPEED_CALC_INTERVAL_MS  50        // Tính tốc độ mỗi 50ms (20 Hz)
#define RAMP_INTERVAL_MS        25        // Khởi động mềm mỗi 25ms (40 Hz)
#define DEBUG_PRINT_INTERVAL_MS 500       // In debug Serial mỗi 500ms

// Ngưỡng Deadzone & Giới hạn gia tốc PWM (Cho phép toàn dải 0-255 PWM để chạy cực êm ở tốc độ chậm 0.10-0.15m/s)
#define MIN_PWM                 0         // 0: Cho phép toàn dải từ 0 đến 255 PWM
#define MAX_PWM_CHANGE_UP       55        // Bơm lực nhanh khi gặp gờ đá / dốc cản
#define MAX_PWM_CHANGE_DOWN     30        // Giảm tốc mượt mà bảo vệ cơ cấu nhông hộp số
#define RAMP_STEP_MAX           14.0f     // Bước ramp tối đa đáp ứng tải nặng
#define RAMP_STEP_MIN           2.0f      // Bước khởi động dứt khoát không bị ì
#define RAMP_STEP_STOP_MAX      5.0f      // Bước giảm tốc êm ái bảo vệ hộp số

// Lọc nhiễu Encoder & Hiệu chuẩn khoảng cách
#define MIN_ENC_INTERVAL_US     200       // Lọc nhiễu gai điện từ, đếm sạch 100% không rớt xung ở mọi dải tốc độ
#define MAX_PLAUSIBLE_RPM       350.0f    // Giới hạn vật lý lọc đột biến RPM
#define DERIVATIVE_FILTER       0.5f      // Hệ số lọc thông thấp vi phân PID
#define DEFAULT_CALIB_SCALE     1.0f      // Hệ số hiệu chuẩn quãng đường thực tế
#define DECEL_DIST_THRESHOLD    0.75f     // Khoảng cách bắt đầu giảm tốc êm trước đích: 75cm (0.75m)
#define DEFAULT_CRAWL_RPM       25.0f     // Tốc độ chạy bò chuẩn xác khi gần đích (RPM)

// Cấu hình khởi động mềm & Bù mô-men xoắn vượt địa hình gồ ghề
#define RPM_ACCEL_RATE          35.0f     // Tăng RPM mục tiêu mượt mà (35 RPM/s): Khởi động siêu êm, không giật
#define RPM_DECEL_RATE          55.0f     // Giảm RPM mục tiêu (55 RPM/s): Hãm dừng êm ái
#define K_COULOMB_FRICTION      28.0f     // Lực bù ma sát khô nhông hộp số 775 (PWM): Duy trì mô-men quay cực khỏe ở tốc độ chậm
#define K_ROUGH_TERRAIN_BOOST   35.0f     // Bơm mô-men mượt mà (35 PWM) khi gặp tải nặng/gờ cản, không bị sốc giật
#define PID_ERROR_DEADBAND      0.6f      // Vùng chết sai số PID 0.6 RPM: Triệt tiêu 100% hiện tượng nhồi ga - nhả ga (săn tốc độ)

// Phát hiện kẹt bánh (Stall Detection) - Cho phép 2.2s dồn 100% mô-men xoắn vượt gờ đất đá
#define STALL_DETECT_MS         2200
#define STALL_PWM_THRESHOLD     180
#define STALL_RPM_THRESHOLD     4.0f

// Chế độ dự phòng nếu có 1 encoder bị hỏng (false: đủ 4 encoder)
#define WHEEL3_ENCODER_FAULT    false

// ============================================================
//  2. SƠ ĐỒ CHÂN GPIO BTS7960 (4 DRIVER ĐỘC LẬP)
// ============================================================
#define DRV1_RPWM   47   // Bánh 0: Trái trước
#define DRV1_LPWM   4
#define DRV2_RPWM   45   // Bánh 1: Trái sau
#define DRV2_LPWM   18
#define DRV3_RPWM   13   // Bánh 2: Phải trước
#define DRV3_LPWM   15
#define DRV4_RPWM   7   // Bánh 3: Phải sau
#define DRV4_LPWM   8

// Cờ đảo chiều driver (+1: bình thường, -1: đảo chiều nếu đấu ngược dây)
#define INV_DRV1     1   // Bánh trái trước: Tiến
#define INV_DRV2     1   // Bánh trái sau: Tiến
#define INV_DRV3    -1   // Bánh phải trước: Đảo chiều để quay cùng chiều tiến với bánh trái
#define INV_DRV4    -1   // Bánh phải sau: Đảo chiều đồng bộ bánh phải trước (đổi thành 1 nếu motor 4 đã đảo dây phần cứng)

#define RGB_LED_PIN 48   // Chân LED RGB tích hợp ESP32-S3

// ============================================================
//  3. CẤU HÌNH WIFI & WEBSERVER
// ============================================================
const char* ssid     = "CTU";
const char* password = "";
WebServer server(80);

const int PWM_FREQ = 7000;
const int PWM_RES  = 8;      // 8-bit: 0 - 255
const int CH_DRV1_F = 0, CH_DRV1_R = 1;
const int CH_DRV2_F = 2, CH_DRV2_R = 3;
const int CH_DRV3_F = 4, CH_DRV3_R = 5;
const int CH_DRV4_F = 6, CH_DRV4_R = 7;

// ============================================================
//  4. CẤU TRÚC DỮ LIỆU ENCODER, PID & SLEW RATE
// ============================================================
struct EncoderData {
  int   pinA, pinB;
  int   sign;                       // +1 bình thường, -1 đảo dấu đếm xung
  volatile long count;
  long  lastSpeedCount;
  float rpm;
  float prevFilteredRpm;
  float speed_ms;
  float distance_m;
};

// Sơ đồ 4 Encoder: Trái trước (16,17), Trái sau (38,39), Phải trước (40,41), Phải sau (10,11)
EncoderData enc[4] = {
  {16, 17,  1, 0, 0, 0.0f, 0.0f, 0.0f, 0.0f}, // enc[0]: Bánh trái trước (+: đếm dương khi tiến)
  {38, 39,  1, 0, 0, 0.0f, 0.0f, 0.0f, 0.0f}, // enc[1]: Bánh trái sau (+: đếm dương khi tiến)
  {40, 41, -1, 0, 0, 0.0f, 0.0f, 0.0f, 0.0f}, // enc[2]: Bánh phải trước (-: đảo dấu để đếm dương khi tiến)
  {10, 11, -1, 0, 0, 0.0f, 0.0f, 0.0f, 0.0f}  // enc[3]: Bánh phải sau (-: đảo dấu để đếm dương khi tiến)
};

struct WheelPID {
  float kp, ki, kd;
  float targetRPM;
  float currentRpmSetpoint;         // Tốc độ đặt tăng giảm mượt mà (Setpoint Profiling)
  float integral;
  float lastError;
  float filteredDeriv;
  int   pwmOutput;
  int   prevPwmOutput;
  bool  enabled;
};

// Hệ số PID tối ưu đồng bộ 4 bánh: Cân bằng vàng (Duy trì mô-men xoắn lớn liên tục, chạy êm ru không giật)
#define PID_KP              1.250f  // Hệ số Kp cân bằng: Phản hồi lực chắc chắn, không bị vọt lố
#define PID_KI              1.050f  // Hệ số Ki: Duy trì mô-men xoắn liên tục, bù triệt để ma sát cơ khí hộp số 775
#define PID_KD              0.080f  // Hệ số Kd: Giảm chấn dập tắt dao động và triệt tiêu rung giật
#define K_SYNC_CROSS_WHEEL  0.900f  // Hệ số bù đồng tốc liên bánh xe êm ái
#define K_LR_BALANCE        1.600f  // Khóa cân bằng cụm Trái - Phải mượt mà, chống xẹo xe
#define K_SIDE_SYNC         0.500f  // Khóa đồng tốc giữa 2 bánh trước - sau cùng bên

WheelPID wpid[4] = {
  {PID_KP, PID_KI, PID_KD, 0, 0, 0, 0, 0, 0, 0, true}, // Bánh 1: Trái trước
  {PID_KP, PID_KI, PID_KD, 0, 0, 0, 0, 0, 0, 0, true}, // Bánh 2: Trái sau
  {PID_KP, PID_KI, PID_KD, 0, 0, 0, 0, 0, 0, 0, true}, // Bánh 3: Phải trước
  {PID_KP, PID_KI, PID_KD, 0, 0, 0, 0, 0, 0, 0, true}  // Bánh 4: Phải sau
};

