vinhlephu-lpv/robot-ws/src/esp32_source/code0109.ino
// Cấu trúc Bộ Lọc Kalman 1D phản ứng nhanh (Độ trễ pha cực thấp < 50ms)
struct Kalman1D {
  float x; // Ước lượng vận tốc RPM
  float p; // Sai số ước lượng
  float q; // Độ bất định mô hình vật lý
  float r; // Độ nhiễu đo lường encoder
  float k; // Hệ số tăng Kalman
};

Kalman1D kfRpm[4] = {
  {0.0f, 1.0f, 0.80f, 1.50f, 0.0f}, // Bánh 1: Đáp ứng siêu tốc, triệt tiêu hoàn toàn trễ pha
  {0.0f, 1.0f, 0.80f, 1.50f, 0.0f}, // Bánh 2
  {0.0f, 1.0f, 0.80f, 1.50f, 0.0f}, // Bánh 3
  {0.0f, 1.0f, 0.80f, 1.50f, 0.0f}  // Bánh 4
};

float updateKalman1D(Kalman1D &kf, float measurement) {
  kf.p = kf.p + kf.q;
  kf.k = kf.p / (kf.p + kf.r);
  kf.x = kf.x + kf.k * (measurement - kf.x);
  kf.p = (1.0f - kf.k) * kf.p;
  return kf.x;
}
#define K_POSITION_ANCHOR       1.2f      // Hệ số neo giữ vị trí vạch đích khi dừng (PWM / xung)

struct SlewChannel {
  int   target;                     // Tốc độ mục tiêu (-255 đến +255)
  float current;                    // Tốc độ hiện tại mượt mà
  float step;                       // Bước ramp động
};

SlewChannel slew[4] = {};

struct WheelHealth {
  bool isFaulty;                    // Đang bị sự cố (kẹt cứng hoặc hẫng lên không trung)
  bool isStalled;                   // Bị kẹt cứng cơ khí / hỏng encoder / hỏng motor
  bool isHanging;                   // Bị hẫng lên không trung (mất ma sát / trượt quay tự do)
  unsigned long stallStartTime;
  unsigned long hangStartTime;
};
WheelHealth wHealth[4] = {};

// Biến điều khiển xe & Quãng đường chính xác
int           currentSpeed            = 200;
bool          isMoving                = false;
bool          manualDriveActive       = false;
bool          pidGlobalEnabled        = true;         // Mặc định BẬT PID mô-men xoắn cao cho cả 4 bánh
float         globalTargetRPM         = 60.0f;        // Tốc độ mục tiêu khởi đầu (chạy chậm lực kéo lớn)
String        currentDirection        = "STOP";

// Điều khiển quãng đường, hiệu chuẩn và Khóa Neo Tọa Độ
bool          isDistanceMode          = false;
float         targetDistMeters        = 0.0f;
float         startDistMeters[4]      = {0, 0, 0, 0};
float         distCalibScale          = DEFAULT_CALIB_SCALE;
float         distCruiseRPM           = DEFAULT_CRAWL_RPM;
bool          isPositionAnchorLocked  = false;        // Cờ khóa neo tọa độ vạch đích (sai số < 3mm)
long          anchorTargetPulses[4]   = {0, 0, 0, 0}; // Tọa độ xung khóa khi chạm vạch đích

unsigned long lastSpeedCalcTime       = 0;
unsigned long lastRampTime            = 0;
unsigned long lastDebugPrintTime      = 0;
volatile unsigned long lastEncTime[4] = {0, 0, 0, 0};

// Điều khiển ROS 2 & Watchdog an toàn
float         rosTargetRpmSigned[4]   = {0.0f, 0.0f, 0.0f, 0.0f};
unsigned long lastRosCmdTime          = 0;
String        serialRxBuf             = "";
#define ROS_WATCHDOG_TIMEOUT_MS         1500

// ============================================================
//  5. CÁC HÀM NGẮT ENCODER (ISR CÓ LỌC GAI NHIỄU IRAM)
// ============================================================
void IRAM_ATTR isr_enc0() {
  unsigned long now = micros();
  if (now - lastEncTime[0] < MIN_ENC_INTERVAL_US) return;
  lastEncTime[0] = now;
  int b = digitalRead(enc[0].pinB);
  enc[0].count += (b > 0) ? enc[0].sign : -enc[0].sign;
}

void IRAM_ATTR isr_enc1() {
  unsigned long now = micros();
  if (now - lastEncTime[1] < MIN_ENC_INTERVAL_US) return;
  lastEncTime[1] = now;
  int b = digitalRead(enc[1].pinB);
  enc[1].count += (b > 0) ? enc[1].sign : -enc[1].sign;
}

void IRAM_ATTR isr_enc2() {
  unsigned long now = micros();
  if (now - lastEncTime[2] < MIN_ENC_INTERVAL_US) return;
  lastEncTime[2] = now;
  int b = digitalRead(enc[2].pinB);
  enc[2].count += (b > 0) ? enc[2].sign : -enc[2].sign;
}

void IRAM_ATTR isr_enc3() {
  unsigned long now = micros();
  if (now - lastEncTime[3] < MIN_ENC_INTERVAL_US) return;
  lastEncTime[3] = now;
  int b = digitalRead(enc[3].pinB);
  enc[3].count += (b > 0) ? enc[3].sign : -enc[3].sign;
}

// ============================================================
//  6. KHÓA CỨNG & XUẤT PWM MOTOR (CHỐNG GIẬT KHỞI ĐỘNG)
// ============================================================
void lockAllDriverPins() {
  const int pins[] = {DRV1_RPWM, DRV1_LPWM, DRV2_RPWM, DRV2_LPWM, DRV3_RPWM, DRV3_LPWM, DRV4_RPWM, DRV4_LPWM};
  for (int p : pins) {
    pinMode(p, OUTPUT);
    digitalWrite(p, LOW);
  }
}

void pwmSetup(int pin, int channel) {
  pinMode(pin, OUTPUT);
  digitalWrite(pin, LOW);
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  ledcAttach(pin, PWM_FREQ, PWM_RES);
  ledcWrite(pin, 0);
#else
  ledcSetup(channel, PWM_FREQ, PWM_RES);
  ledcAttachPin(pin, channel);
  ledcWrite(channel, 0);
#endif
}

void pwmWrite(int pin, int channel, int value) {
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  ledcWrite(pin, value);
#else
  ledcWrite(channel, value);
#endif
}

void writeSingleDrive(int rpwmPin, int lpwmPin, int chF, int chR, int speed, int inv) {
  speed = speed * inv;
  if (speed > 0) {
    pwmWrite(rpwmPin, chF, speed);
    pwmWrite(lpwmPin, chR, 0);
  } else if (speed < 0) {
    pwmWrite(rpwmPin, chF, 0);
    pwmWrite(lpwmPin, chR, -speed);
  } else {
    pwmWrite(rpwmPin, chF, 0);
    pwmWrite(lpwmPin, chR, 0);
  }
}

void writeAllDrives(int s0, int s1, int s2, int s3) {
  writeSingleDrive(DRV1_RPWM, DRV1_LPWM, CH_DRV1_F, CH_DRV1_R, s0, INV_DRV1);
  writeSingleDrive(DRV2_RPWM, DRV2_LPWM, CH_DRV2_F, CH_DRV2_R, s1, INV_DRV2);
  writeSingleDrive(DRV3_RPWM, DRV3_LPWM, CH_DRV3_F, CH_DRV3_R, s2, INV_DRV3);
  writeSingleDrive(DRV4_RPWM, DRV4_LPWM, CH_DRV4_F, CH_DRV4_R, s3, INV_DRV4);
}

// Khai báo nguyên mẫu hàm
void stopMotor(bool emergency);
void stopMotor();
void setVehicleSpeed(int spd);
void updateWheelHealth();
void updatePID(float dt);

// ============================================================
//  7. TÍNH TOÁN VẬN TỐC & SỨC KHỎE BÁNH XE
// ============================================================
inline float median3(float a, float b, float c) {
  if ((a <= b && b <= c) || (c <= b && b <= a)) return b;
  if ((b <= a && a <= c) || (c <= a && a <= b)) return a;
  return c;
}

