vinhlephu-lpv/robot-ws/src/esp32_source/code0109.ino
// ============================================================
//  8. THUẬT TOÁN PID + TORQUE BOOST + TỰ BÙ MÔ-MEN BÁNH HỎNG/HẪNG
// ============================================================
void updatePID(float dt) {
  if (!pidGlobalEnabled) return;

  // 1. BỘ KHÓA NEO TỌA ĐỘ VỊ TRÍ VẠCH ĐÍCH (Position Anchor Filter)
  if (isPositionAnchorLocked && !isMoving) {
    for (int i = 0; i < 4; i++) {
      long pulseDiff = enc[i].count - anchorTargetPulses[i];
      if (abs(pulseDiff) > 2) {
        int holdPWM = constrain((int)(-pulseDiff * 0.8f * enc[i].sign), -50, 50);
        slew[i].target = holdPWM;
      } else {
        slew[i].target = 0;
      }
    }
    return;
  }

  if (!isMoving) {
    for (int i = 0; i < 4; i++) {
      wpid[i].currentRpmSetpoint = 0.0f;
      wpid[i].pwmOutput = 0;
      wpid[i].prevPwmOutput = 0;
      wpid[i].integral = 0.0f;
    }
    return;
  }

  float actualRPM[4];
  for (int j = 0; j < 4; j++) actualRPM[j] = fabsf(enc[j].rpm);

  float avgLeft  = (actualRPM[0] + actualRPM[1]) / 2.0f;
  float avgRight = (actualRPM[2] + actualRPM[3]) / 2.0f;
  float avgTotal = (avgLeft + avgRight) / 2.0f;

  bool isStraight = (currentDirection == "FORWARD" || currentDirection == "BACKWARD" ||
                    (currentDirection == "ROS" && fabsf(rosTargetRpmSigned[0] - rosTargetRpmSigned[2]) < 1.0f));

  // KHÓA ĐỒNG TỐC VI SAI TRÁI - PHẢI TỨC THỜI (Active Left-Right Heading Lock):
  float lrDiff = 0.0f;
  if (isStraight && isMoving) {
    lrDiff = avgLeft - avgRight;
  }
  float lrCorrection = constrain(lrDiff * K_LR_BALANCE, -45.0f, 45.0f);

  for (int i = 0; i < 4; i++) {
#if WHEEL3_ENCODER_FAULT
    if (i == 3) {
      wpid[3].pwmOutput          = wpid[2].pwmOutput;
      wpid[3].prevPwmOutput      = wpid[2].prevPwmOutput;
      wpid[3].currentRpmSetpoint = wpid[2].currentRpmSetpoint;
      slew[3].target             = slew[2].target;
      continue;
    }
#endif
    if (!wpid[i].enabled) continue;

    float rpm_act     = actualRPM[i];
    float finalTarget = wpid[i].targetRPM;
    bool  isLeft      = (i == 0 || i == 1);

    // BỘ TẠO QUỸ ĐẠO RPM MỤC TIÊU MƯỢT MÀ (Setpoint Profiler - Triệt tiêu 100% cú giật khởi động):
    if (finalTarget > wpid[i].currentRpmSetpoint) {
      wpid[i].currentRpmSetpoint = min(finalTarget, wpid[i].currentRpmSetpoint + RPM_ACCEL_RATE * dt);
    } else if (finalTarget < wpid[i].currentRpmSetpoint) {
      wpid[i].currentRpmSetpoint = max(finalTarget, wpid[i].currentRpmSetpoint - RPM_DECEL_RATE * dt);
    }
    float setpoint = wpid[i].currentRpmSetpoint;

    if (setpoint <= 0.2f && finalTarget <= 0.1f) {
      wpid[i].pwmOutput = 0;
      wpid[i].integral = 0.0f;
      wpid[i].currentRpmSetpoint = 0.0f;
      slew[i].target = 0;
      continue;
    }

    // 1. Lực bù ma sát khô Coulomb (Thắng ma sát tĩnh nhông hộp số 775 ở mọi dải tốc độ):
    float coulomb_ff = (setpoint > 0.3f) ? K_COULOMB_FRICTION : 0.0f;

    // 2. Feedforward PWM cơ sở tuyến tính 0-255:
    float ff_pwm = (setpoint / 220.0f) * (255.0f - K_COULOMB_FRICTION);

    // 3. Sai số bám tốc độ mục tiêu (Tracking Error) có vùng chết chống dao động:
    float track_error = setpoint - rpm_act;
    if (fabsf(track_error) < PID_ERROR_DEADBAND) {
      track_error = 0.0f;
    }

    // 4. Sai số đồng tốc Cross-Coupling 4 bánh:
    float sync_error = 0.0f;
    if (isStraight) {
      sync_error = (avgTotal - rpm_act);
    }
    float sync_gain = K_SYNC_CROSS_WHEEL;

    // 5. Sai số tổng hợp đưa vào khâu PID:
    float total_error = track_error + (sync_error * sync_gain);

    // 6. Khâu tích phân (Integral) - Bù đắp hoàn toàn ma sát tĩnh cơ khí hộp số 775:
    float maxIntegral = (setpoint <= 65.0f) ? 65.0f : 110.0f;
    wpid[i].integral = constrain(wpid[i].integral + total_error * dt, -maxIntegral, maxIntegral);

    // 7. Khâu vi phân (Derivative) có lọc thông thấp dập tắt dao động:
    float rawDeriv = (total_error - wpid[i].lastError) / dt;
    wpid[i].filteredDeriv = DERIVATIVE_FILTER * rawDeriv + (1.0f - DERIVATIVE_FILTER) * wpid[i].filteredDeriv;
    wpid[i].lastError = total_error;

    // 8. Tính toán PID cơ sở:
    float pid_corr = (wpid[i].kp * total_error) + (wpid[i].ki * wpid[i].integral) + (wpid[i].kd * wpid[i].filteredDeriv);

    // 9. Bù khóa cân bằng Trái - Phải và đồng bộ Trước - Sau cùng bên:
    float balance_corr = 0.0f;
    float side_sync_corr = 0.0f;
    if (isStraight) {
      balance_corr = isLeft ? (-lrCorrection) : (lrCorrection);
      float side_diff = isLeft ? (avgLeft - rpm_act) : (avgRight - rpm_act);
      side_sync_corr = side_diff * K_SIDE_SYNC;
    }

    // 10. BÙ MÔ-MEN XOẮN DUY TRÌ LỰC KÉO TỐC ĐỘ THẤP (Êm ái, liên tục, không nhồi giật):
    float torque_boost = 0.0f;
    if (setpoint < 75.0f && track_error > 1.5f) {
      float defectRatio = constrain(track_error / setpoint, 0.0f, 1.0f);
      torque_boost = defectRatio * K_ROUGH_TERRAIN_BOOST;
    }

    // Khâu duy trì từ trường liên tục ở tốc độ chậm (giúp động cơ 775 quay cực khỏe, không bị ì ma sát):
    float low_speed_torque_maintain = 0.0f;
    if (setpoint > 0.5f && setpoint <= 45.0f) {
      float crawlRatio = (45.0f - setpoint) / 45.0f;
      low_speed_torque_maintain = crawlRatio * 8.0f; // Duy trì 3 - 8 PWM từ trường liên tục
    }

    // 11. Tổng hợp PWM điều khiển hoàn chỉnh (Toàn dải 0-255):
    int desired = constrain((int)(ff_pwm + coulomb_ff + pid_corr + balance_corr + side_sync_corr + torque_boost + low_speed_torque_maintain), 0, 255);

    // Giới hạn trần an toàn:
    if (setpoint <= 65.0f && rpm_act >= setpoint * 0.95f) {
      int safeRunningCap = constrain((int)((setpoint / 65.0f) * 160.0f + 65.0f), 35, 255);
      if (desired > safeRunningCap) desired = safeRunningCap;
    } else {
      int userPwmCap = (currentDirection == "ROS") ? 255 : max((int)currentSpeed, 0);
      if (rpm_act >= setpoint * 0.95f && desired > userPwmCap) {
        desired = userPwmCap;
      }
    }

    // Giới hạn biến thiên PWM bất đối xứng:
    int maxChange = (desired > wpid[i].prevPwmOutput) ? MAX_PWM_CHANGE_UP : MAX_PWM_CHANGE_DOWN;
    int delta     = constrain(desired - wpid[i].prevPwmOutput, -maxChange, maxChange);
    wpid[i].pwmOutput     = constrain(wpid[i].prevPwmOutput + delta, 0, 255);
    wpid[i].prevPwmOutput = wpid[i].pwmOutput;
    
    // XỬ LÝ CHO BÁNH BỊ SỰ CỐ:
    if (wHealth[i].isStalled) { 
      wpid[i].pwmOutput = min(wpid[i].pwmOutput, 85); // Hạn chế nhiệt driver khi kẹt cứng vật lý lâu
      wpid[i].integral = 0; 
    } else if (wHealth[i].isHanging) {
      wpid[i].pwmOutput = 0;
      wpid[i].integral = 0;
    }

    // 12. Quy tắc chiều quay 4 bánh (Tank Drive & ROS)
    int sign = 0;
    if (currentDirection == "FORWARD")       sign = 1;
    else if (currentDirection == "BACKWARD") sign = -1;
    else if (currentDirection == "LEFT")     sign = isLeft ? -1 : 1;
    else if (currentDirection == "RIGHT")    sign = isLeft ? 1 : -1;
    else if (currentDirection == "ROS")      sign = (rosTargetRpmSigned[i] >= 0.0f) ? 1 : -1;

    slew[i].target = sign * wpid[i].pwmOutput;
  }
}

